In [12]:
import pandas as pd
import matplotlib.pyplot as plt
df = pd.read_csv('../data/employees.csv')
df

   age  salary  years_at_company  job_satisfaction  left
0   25   30000                 1                 2     1
1   30   50000                 5                 4     0
2   45   80000                10                 3     0
3   28   35000                 2                 1     1
4   35   60000                 6                 4     0
5   50   90000                15                 2     0
6   26   32000                 1                 1     1
7   40   70000                 8                 3     0

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   age               8 non-null      int64
 1   salary            8 non-null      int64
 2   years_at_company  8 non-null      int64
 3   job_satisfaction  8 non-null      int64
 4   left              8 non-null      int64
dtypes: int64(5)
memory usage: 452.0 bytes

In [14]:
df.describe()

             age        salary  years_at_company  job_satisfaction      left
count   8.000000      8.000000          8.000000          8.000000  8.000000
mean   34.875000  55875.000000          6.000000          2.500000  0.375000
std     9.295736  22906.253045          4.898979          1.195229  0.517549
min    25.000000  30000.000000          1.000000          1.000000  0.000000
25%    27.500000  34250.000000          1.750000          1.750000  0.000000
50%    32.500000  55000.000000          5.500000          2.500000  0.000000
75%    41.250000  72500.000000          8.500000          3.250000  1.000000
max    50.000000  90000.000000         15.000000          4.000000  1.000000

In [15]:
df['left'].value_counts()

left
0    5
1    3
Name: count, dtype: int64